# 1) Сгенерировать dict() из списка ключей ниже по формуле (key : key* key).keys = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# ожидаемый результат: {1: 1, 2: 4, 3: 9 …}

# 2) Сгенерировать массив(list()). Из диапазона чисел от 0 до 100 записать в результирующий массив только четные числа.
# =======================================================
# 3)Заменить в произвольной строке согласные буквы на гласные.

# =======================================================
# 4)Дан массив чисел.[10, 11, 2, 3, 5, 8, 23, 11, 2, 5, 76, 43, 2, 32, 76, 3, 10, 0, 1]
# 4.1) убрать из него повторяющиеся элементы
# 4.2) вывести 3 наибольших числа из исходного массива
# 4.3) вывести индекс минимального элемента массива
# 4.4) вывести исходный массив в обратном порядке

# =======================================================
# 5) Найти общие ключи в двух словарях:
# dict_one = {'a': 1, 'b': 2, 'c': 3, 'd': 4}
# dict_two = {'a': 6, 'b': 7, 'z': 20, 'x': 40}

# =======================================================
# 6)Дан массив из словарей
# data = [
#     {'name': 'Viktor', 'city': 'Kiev', 'age': 30},
#     {'name': 'Maksim', 'city': 'Dnepr', 'age': 20},
#     {'name': 'Vladimir', 'city': 'Lviv', 'age': 32},
#     {'name': 'Andrey', 'city': 'Kiev', 'age': 34},
#     {'name': 'Artem', 'city': 'Dnepr', 'age': 50},
#     {'name': 'Dmitriy', 'city': 'Lviv', 'age': 21}]

# =======================================================
# 6.1) отсортировать массив из словарей по значению ключа 'age'
# 6.2) сгруппировать данные по значению ключа 'city'
# вывод должен быть такого вида :
# result = {
#    'Kiev': [
#       {'name': 'Viktor', 'age': 30 },
#       {'name': 'Andrey', 'age': 34}],
#
#    'Dnepr': [ {'name': 'Maksim', 'age': 20 },
#               {'name': 'Artem', 'age': 50}],
#    'Lviv': [ {'name': 'Vladimir', 'age': 32 },
#              {'name': 'Dmitriy', 'age': 21}]
# }
# =======================================================
# 7) У вас есть последовательность строк.Необходимо определить наиболее часто встречающуюся строку в последовательности.
# Например:

# def most_frequent(list_var):
#     # your code is here
#     return
#
# most_frequent(['a', 'a', 'bi', 'bi', 'bi']) == 'bi'
# =======================================================
# 8) Дано целое число. Необходимо подсчитать произведение всех цифр в этом числе, за исключением нулей.
# Например:
# Дано число 123405. Результат будет: 1*2*3*4*5=120.

# =======================================================
# 9) Есть массив с положительными числами и число n (def some_function(array, n)).
# Необходимо найти n-ую степень элемента в массиве с индексом n. Если n за границами массива, тогда вернуть -1.

# =======================================================
# 10) Есть строка со словами и числами, разделенными пробелами (один пробел между словами и/или числами).
# Слова состоят только из букв. Вам нужно проверить есть ли в исходной строке три словаподряд.
# Для примера, в строке "hello 1one two three15 world" есть три слова подряд.

import random


# 1 =======================================================
def first_exercise():
    key = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    number_dict = dict({k: (k*k) for k in key})
    print(number_dict)


first_exercise()


# 2 =======================================================
def second_exercise():
    number_list = list(i for i in range(101) if i % 2 == 0)
    print(number_list)


second_exercise()


# 3 =======================================================
def third_exercise():
    vowels_letters = ['A', 'E', 'I', 'O', 'U', 'Y']
    consonant_letters = ['B', 'C', 'D', 'F', 'G', 'H', 'J', 'K', 'L', 'M', 'N', 'P', 'Q', 'R', 'S', 'T', 'V', 'W', 'X', 'Y', 'Z']
    some_string = '''Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod 
                        tempor incididunt ut labore et dolore magna aliqua.'''
    for vowel_letter in vowels_letters:
        for letter_in_string in some_string:
            if letter_in_string.lower() == vowel_letter.lower():
                some_string = some_string.replace(letter_in_string, random.choice(consonant_letters))
    print(some_string)


third_exercise()


# 4 =======================================================
def fourth_exercise():
    numbers = [10, 11, 2, 3, 5, 8, 23, 11, 2, 5, 76, 43, 2, 32, 76, 3, 10, 0, 1]
    print(set(numbers)) # 4.1



fourth_exercise()